package com.example.cielo;

public class Todo {

    /*


        (점검) startActivity => loading화면으로 바꾸기
        성분이없는경우 어쩌징

        리뷰도 필터링 => 같은나이대, 같은생리양 기준
        옵션별로 정렬함 => 복합쿼리로
            같은 추천수면 가격낮은순
            같은 가격이면 높은추천순



        (필요한가?) 리뷰등록시 매너온도상승

        (필요x)한사람당 하나의 review만달수있도록
        (필요X) 라디오 reselect 함수만들기

        (해결) 검색어 / 조건 아무것도없으면 toastmessage
        (해결) 회원가입 실패사유가 안뜸 (toastmessage)
        (해결) 리뷰가 없으면 리뷰가 없다고 표시하기 (아래에 리뷰란이라고  표시를하는게좋은거같음)
        (해결) EditText 바깥을 누르면 키보드내려가게 하게 https://featherwing.tistory.com/4
        (해결) 닉네임중복체크하고 다시중복된닉네임으로바꾸면 회원가입되는현상 => ontextchanged로 해결
        (해결) 나중에 에진이랑 합칠때 어댑터에서 상세, 성분화면으로 둘다쏠수있도록해야될거같음 (show를하면 안보이는거같으므로)
        (해결) result화면에서 재검색 => refresh방법
        (해결) 그리고거기서 재검색하고싶을때
        (해결) 전성분그거 통계
        (해결) 닉네임 중복체크 + 닉네임통과여부표시
        (해결) 사용자계정 => 생리양 추가하기 + 값 비었는지 아닌지 확인하기
        (해결) memberinit에서 생리양그거 데이터베이스에추가하는코드
        (해결) 키보드 adjustpan => navigation 모델 고쳐서 해결함
        (해결) 길이넘겨주기
        (해결) 리뷰가 하나씩만 등록되고 있음 배열이아니라 하위컬렉션으로 접근하자 => 배열로해결ㅋㅋ..
        (해결) frag_pad => ingredient, length 가져오기
        (해결) 어댑터합치기
        (해결) 커스텀라디오버튼으로 그 성분선택하는거 수정하기
        (해결) 검색결과화면에서 키워드없을때 어떡하지?
        (해결) mainactivity => showselectedItem 통합

     */
}
